app/views/users/show.html.erb

  if(navigator.geolocation) {
    navigator.geolocation.getCurrentPosition(function(position) {
       pos = new google.maps.LatLng(position.coords.latitude,
                                       position.coords.longitude);
      latitude = pos.lat();
      longitude = pos.lng();
      var f1 = document.getElementById("form1");
	  var f2 = document.getElementById("form2");
	 // form = document.getElementsByClassName("edit_user");

	f1.value = latitude;
	f2.value = longitude;

 var f1tmp = <%=@user.latitude%>
  var f2tmp = <%=@user.longitude%>

 if( (f1tmp == 0 && f2tmp == 0) )
  {
    document.forms[0].submit();
  }


---
SELECT "users".* FROM "users"