app/controllers/sessions_controller.rb

		def create
			@user = User.find_by_email(params[:session][:email].downcase)
---
SELECT "users".* FROM "users" WHERE "users"."email" = 'a@africanhipacademy.org' LIMIT 1