app/controllers/users_controller.rb

  def create
  	@user = User.new(params[:user])

  	if @user.save
---
INSERT INTO "users" ("created_at", "education", "email", "firstname", "hashed_password", "lastname", "latitude", "longitude", "remember_token", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def show
  	@user = User.find(params[:id])
  	@users = User.all
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "2"]]
SELECT "users".* FROM "users"

  def update
  	@user = User.find(params[:id])
  	@user.latitude = params[:user][:latitude]
  	@user.longitude = params[:user][:longitude]


  	if @user.update_attributes(params[:user])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "2"]]
UPDATE "users" SET "firstname" = 'kk', "lastname" = 'kk', "remember_token" = 'p0seL4NvdBwn2KiCPbsPXg==', "updated_at" = '2013-07-04 14:32:04.839103' WHERE "users"."id" = 1